---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericTransparency
source: html/11f92982-d5c5-37d7-40ce-6200e4b2f1ff.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericTransparency Property

The property labeled "Transparency" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericTransparency { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
 This property allows a connected asset.